{
  "filmes": [
    {
      "id": "1",
      "titulo": "Homem Aranha",
      "categoria": "Ação",
      "descricao": "Depois de ser picado por uma aranha geneticamente modificada em uma demonstração científica, o jovem nerd Peter Parker ganha superpoderes. Inicialmente, ele pretende usá-los para para ganhar dinheiro, adotando o nome de Homem-Aranha e se apresentando em lutas de exibição. Porém, ao presenciar o assassinando de seu tio Ben e sentir-se culpado, Peter decide não mais usar seus poderes para proveito próprio e sim para enfrentar o mal, tendo como seu primeiro grande desafio o psicótico Duende Verde.",
      "video": "https://www.youtube.com/watch?v=Ga8ZkXpfXN8",
      "imagem": "https://upload.wikimedia.org/wikipedia/pt/1/14/Spide-Man_Poster.jpg"
    },
    {
      "id": "2",
      "titulo": "Dançando no Escuro",
      "categoria": "Drama",
      "descricao": "Selma é uma imigrante checa e mãe solteira que trabalha em uma fábrica no interior dos Estados Unidos. Sua salvação é paixão pela música, especialmente os musicais clássicos de Hollywood. Selma está perdendo a visão e seu filho Gene pode sofrer o mesmo destino se ela não conseguir economizar dinheiro suficiente para fazer uma operação.",
      "video": "https://www.youtube.com/watch?v=ILr2sYclMC4",
      "imagem": "https://personaunesp.com.br/wp-content/uploads/2020/12/FOTO-1-1-1.jpg"
    },
    {
      "id": "3",
      "titulo": "Matilda",
      "categoria": "Infantil",
      "descricao": "Matilda é uma criança brilhante que cresceu ignorada pelos pais, a ponto de esquecerem de matriculá-la na escola. Quando a menina descobre que possui poderes mágicos e seu pai a manda estudar, ela precisa proteger os colegas da malvada diretora.",
      "video": "https://www.youtube.com/watch?v=simTHZkOPv8",
      "imagem": "https://br.web.img3.acsta.net/pictures/210/123/21012312_20130613132958221.jpg"
    },
    {
      "id": "4",
      "titulo": "X-Men: Dias de um futuro esquecido",
      "categoria": "Ação",
      "descricao": "O Dr. Bolivar Trask acredita que os mutantes são uma ameaça para a humanidade. Ele desenvolve gigantescos robôs chamados Sentinelas, que perseguem impiedosamente os mutantes. Os poucos sobreviventes precisam viver escondidos. Wolverine viaja no tempo para procurar os jovens Xavier e Magneto e impedir que eles sejam caçados e aniquilados no futuro.",
      "video": "https://www.youtube.com/watch?v=GP1G-XKxleM",
      "imagem": "https://upload.wikimedia.org/wikipedia/pt/f/f8/X-Men_Dias_Futuro_Esquecido_2014.jpg"
    },
    {
      "id": "5",
      "titulo": "João e Maria Caçadores de Bruxas",
      "categoria": "Ação",
      "descricao": "João e Maria foram abandonados pelos pais na sombria floresta e acabam indo parar na casa de uma malvada bruxa. Eliminaram a malvada e viraram verdadeiros exterminadores de criaturas do mal. Após o desaparecimento de várias crianças, os dois já adultos são contratados pelas autoridades locais para desvendar o mistério. Só que eles não imaginavam que essa nova missão iria colocá-los diante da terrível Bruxa Negra.",
      "video": "https://www.youtube.com/watch?v=Xs3ss61iyQs",
      "imagem": "https://br.web.img3.acsta.net/medias/nmedia/18/93/11/58/20392738.jpg"
    },
    {
      "id": "6",
      "titulo": "Tropa de Elite 2: O Inimigo Agora é Outro",
      "categoria": "Ação",
      "descricao": "Depois de uma operação fracassada, Nascimento é afastado do Bope e agora trabalha como subsecretário de Inteligência na Secretaria de Segurança Pública do Rio de Janeiro. No novo cargo, o ex-capitão é arrastado para uma disputa política sangrenta que envolve funcionários do governo e grupos paramilitares.",
      "video": "https://www.youtube.com/watch?v=J9ytvIKbQuo",
      "imagem": "https://media.fstatic.com/rkzT72QmT4HTgUMHhl2dKxHMIUE=/322x478/smart/filters:format(webp)/media/movies/covers/2023/01/imagem_2023-01-16_204812329.png"
    },
    {
      "id": "7",
      "titulo": "Medianeras",
      "categoria": "Romance",
      "descricao": "Martín e Mariana são seres solitários que moram em Buenos Aires e têm dificuldades em se relacionar com o mundo. Por mais que sempre se cruzem nas ruas, nunca se viram. Na busca de alguém que os compreenda, eles afogam mágoas e alegrias.",
      "video": "https://www.youtube.com/watch?v=kmBzxutYLOA",
      "imagem": "https://images.adsttc.com/media/images/50eb/3550/b3fc/4b25/d500/0085/large_jpg/medianeras-cartel.jpg?1361401773"
    },
    {
      "id": "8",
      "titulo": "Na Companhia do Medo",
      "categoria": "Suspense",
      "descricao": "A vida da psiquiatra criminal Miranda Grey sai dos trilhos depois que ela quase atropela uma garota. Miranda acorda internada na clínica para deficientes mentais em que trabalha, sob os cuidados de seu colega Pete Graham. Completamente desorientada, ela é acusada de ter matado o próprio marido, mas não se lembra de nada depois do incidente com a garota. Lentamente, a psiquiatra começa a descobrir o que aconteceu, mas precisa escapar do sanatório para desvendar o mistério.",
      "video": "https://www.youtube.com/watch?v=GkpwZcYcODg",
      "imagem": "https://br.web.img3.acsta.net/c_310_420/pictures/210/505/21050587_20131017172916152.jpg"
    },
    {
      "id": "9",
      "titulo": "Sobrenatural",
      "categoria": "Terror",
      "descricao": "Josh e Renai se mudam com a família para uma casa maior. Lá, o filho Dalton sofre um estranho acidente e entra em coma. Enquanto eles tentam salvar o menino, entidades malignas atormentam a família.",
      "video": "https://www.youtube.com/watch?v=RQPT0tRl4Tc",
      "imagem": "https://br.web.img3.acsta.net/c_310_420/medias/nmedia/18/87/35/24/19874611.jpg"
    },
    {
      "id": "10",
      "titulo": "101 Dalmatas",
      "categoria": "Animação",
      "descricao": "A estilista Anita e Roger, um escritor de jogos de computadores, se encontram, se apaixonam e se casam, juntamente com seus dálmatas Pongo e Perdita. Os filhotes dos cães são sequestrados pela chefe de Anita, Cruella De Vil, que está roubando filhotes de dálmatas para fazer o casaco pelo qual ela está apaixonada. Pongo e Perdita tentam encontrar e salvar todos os noventa e nove filhotes de seus terríveis captores.",
      "video": "https://www.youtube.com/watch?v=tEPNTIhVXGI",
      "imagem": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSX5H0bdGSAa0tBfEpkhnwprY60-lOoKAvTog&s"
    },
    {
      "id": "11",
      "titulo": "Click",
      "categoria": "Romance",
      "descricao": "Um arquiteto casado e com filhos está cada vez mais frustrado por passar a maior parte de seu tempo trabalhando. Um dia, ele encontra um inventor excêntrico que lhe dá um controle remoto universal, com capacidade de acelerar o tempo. No início, ele usa o aparelho para acelerar qualquer momento tedioso, mas se dá conta de que está acelerando o tempo demais e deixando de viver preciosos momentos em família. Desesperado, ele procura o inventor para ajudá-lo a reverter o que fez.",
      "video": "https://www.youtube.com/watch?v=LU-xe_64m_U",
      "imagem": "https://musicart.xboxlive.com/7/b7681100-0000-0000-0000-000000000002/504/image.jpg?w=1920&h=1080"
    },
    {
      "id": "12",
      "titulo": "Esqueceram de Mim",
      "categoria": "Infantil",
      "descricao": "Kevin, de apenas oito anos, é um garoto encrenqueiro que foi acidentalmente esquecido sozinho em casa pela família durante as férias de Natal. Agora, o menino precisa usar a criatividade e proteger sua casa de um par de ladrões atrapalhados.",
      "video": "https://www.youtube.com/watch?v=3nc7yyHBoFA",
      "imagem": "https://br.web.img3.acsta.net/medias/nmedia/18/93/93/95/20287484.jpg"
    },
    {
      "id": "13",
      "titulo": "Os Pinguins do Papai",
      "categoria": "Comédia",
      "descricao": "Popper é um executivo de sucesso que não tem muito tempo para a família. Mas seu destino muda quando ele recebe seis pinguins de herança do pai, transformando seu apartamento luxuoso em um habitat para os animais.",
      "video": "https://www.youtube.com/watch?v=Di4wiwImYyI",
      "imagem": "https://upload.wikimedia.org/wikipedia/pt/thumb/0/00/Mr._Popper%27s_Penguins_Poster.jpg/250px-Mr._Popper%27s_Penguins_Poster.jpg"
    },
    {
      "id": "14",
      "titulo": "Pink Floyd: The Wall",
      "categoria": "Música",
      "descricao": "The Wall é o décimo primeiro álbum de estúdio da banda britânica de rock Pink Floyd. Lançado como álbum duplo em 30 de novembro de 1979 foi, posteriormente, tocado ao vivo com efeitos teatrais, além de ter sido adaptado para o cinema.",
      "video": "https://www.youtube.com/watch?v=85t5GgCYZ1s",
      "imagem": "https://upload.wikimedia.org/wikipedia/pt/6/63/Pink_Floyd_%E2%80%93_The_Wall.jpg"
    },
    {
      "id": "15",
      "titulo": "Um amor para recordar",
      "categoria": "Romance",
      "descricao": "Um jovem delinquente do ensino médio é obrigado a ser o tutor de uma escola de baixa renda. Lá, ele se apaixona pela filha do pastor e vive uma paixão cheia de diferenças e surpresas.",
      "video": "https://www.youtube.com/watch?v=UFIFTJN43mc",
      "imagem": "https://br.web.img3.acsta.net/medias/nmedia/18/94/82/78/20359454.jpg"
    },
    {
      "id": "16",
      "titulo": "Não Solte!",
      "categoria": "Suspense",
      "descricao": "Uma família que é assombrada por um espírito maligno há anos. Sua segurança e seus arredores entram em dúvida quando um dos filhos questiona a realidade do mal.",
      "video": "https://www.youtube.com/watch?v=6TDZWj0LN44",
      "imagem": "https://br.web.img3.acsta.net/img/4e/bf/4ebf1fa3f5ce54e673593fa7bd41245f.PNG"
    },
    {
      "id": "17",
      "titulo": "A procura da Felicidade",
      "categoria": "Drama",
      "descricao": "Chris enfrenta sérios problemas financeiros e sua esposa, Linda, decide partir. Agora solteiro, ele precisa cuidar de Christopher, seu filho de cinco anos. Chris tenta usar sua habilidade como vendedor para conseguir um emprego melhor, mas só consegue um estágio não-remunerado. Seus problemas financeiros não podem esperar uma promoção e eles acabam despejados. Chris e Christopher passam a dormir em abrigos ou onde quer que consigam um refúgio, mantendo a esperança de que dias melhores virão.",
      "video": "https://www.youtube.com/watch?v=KS3vxhFzwjQ",
      "imagem": "https://upload.wikimedia.org/wikipedia/pt/1/1e/The_Pursuit_of_Happyness.jpg"
    },
    {
      "id": "18",
      "titulo": "Gente Grande 2",
      "categoria": "Comédia",
      "imagem": "https://br.web.img3.acsta.net/c_310_420/pictures/210/049/21004903_20130510170049514.jpg",
      "video": "https://www.youtube.com/watch?v=XgInBFhD6TU",
      "descricao": "Lenny Feder e a família se mudam para a própria cidade natal com o objetivo ficarem perto dos amigos, mas acabam tendo que enfrentar alguns fantasmas do passado, como a covardia diante de valentões e o famigerado bullying na escola."
    },
    {
      "id": "19",
      "titulo": "Vá e Veja",
      "categoria": "Drama",
      "imagem": "https://m.media-amazon.com/images/I/51cnBG8s9sL._AC_UF894,1000_QL80_.jpg",
      "video": "https://www.youtube.com/watch?v=lo1VAiLrkdc",
      "descricao": "O filme é uma experiência de dor e perda. Considerado selvagem e lírico, confira a trajetória de Florya, um jovem separado de seus comandantes durante a Segunda Guerra Mundial."
    },
    {
      "id": "e503",
      "titulo": "teastando",
      "categoria": "Terror",
      "imagem": "reree",
      "video": "rerere",
      "descricao": "rererererere"
    }
  ]
}